// 29 variant
//J  B  WS  const                                   WA
 0  0  00  00000000000000000000001                 00001    // reg[1] = a записываем константу в регист 1                                         вывод нуля

//J  B  WS  comand_const                            WA
 0  0  10  00000000000000000000000                 00010    //reg[2] = sw_i записали со входа                                                     вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000111                 00011    // reg[3] = записываем маску                                                          вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000000                 00010    // reg[4] = переменная переноса будет                                                 вывод нуля

 //J  B  WS  const                                   WA
 0  0  00  00000000000000000000000                 00101    // reg[5] = правые 3 бита a в данный момент будет                                     вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000001                 00110    // reg[6] = 1 для счетчика                                                            вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000000                 00111    // reg[7] = tmp будет                                                                 вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000000                 01000    // reg[8] = answer                                                                    вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000011                 01001    // reg[9] =  для переноса на 3                                                        вывод нуля

//J  B  WS  const                                   WA
 0  0  00  00000000000000000000000                 01010    // reg[10] = просто константа для нуля                                                 вывод нуля

 // ############################################################################################################################################################################################
